-- phpMyAdmin SQL Dump
-- version 4.1.14
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2016-08-19 14:25:54
-- 服务器版本： 5.6.17
-- PHP Version: 5.5.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `hnucdomi`
--

-- --------------------------------------------------------

--
-- 表的结构 `stu_info`
--

DROP TABLE IF EXISTS `stu_info`;
CREATE TABLE IF NOT EXISTS `stu_info` (
  `exm_id` int(18) NOT NULL,
  `id` int(11) NOT NULL,
  `name` varchar(20) NOT NULL,
  `academy` varchar(100) NOT NULL,
  `class` varchar(100) NOT NULL,
  `domi_num` varchar(20) NOT NULL,
  UNIQUE KEY `id` (`id`),
  KEY `name` (`name`,`domi_num`),
  KEY `domi_num` (`domi_num`),
  KEY `exm_id` (`exm_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 插入之前先把表清空（truncate） `stu_info`
--

TRUNCATE TABLE `stu_info`;
--
-- 转存表中的数据 `stu_info`
--

INSERT INTO `stu_info` (`exm_id`, `id`, `name`, `academy`, `class`, `domi_num`) VALUES
(1122334455, 111111111, '张一', '计算机与信息工程学院', '待补充', '贤德1栋109'),
(2147483647, 111111112, '张二', '计算机与信息工程学院', '待补充', '贤德1栋110'),
(2143312431, 111111113, '张三', '计算机与信息工程学院', '待补充', '贤德1栋111'),
(434687, 111111114, '张四', '计算机与信息工程学院', '待补充', '贤德1栋112'),
(1223345678, 111111115, '张五', '计算机与信息工程学院', '待补充', '贤德1栋113'),
(2147483647, 111111116, '张六', '计算机与信息工程学院', '待补充', '贤德1栋114'),
(1134534657, 111111117, '张七', '会计学院', '待补充', '贤德1栋114'),
(2147483647, 111111118, '张八', '会计学院', '待补充', '贤德1栋114'),
(32542134, 111111119, '张九', '会计学院', '待补充', '贤德1栋114'),
(2147483647, 111111120, '李一', '会计学院', '待补充', '贤德1栋114'),
(67656543, 111111121, '李二', '会计学院', '待补充', '贤德1栋114'),
(54545134, 111111122, '李三', '会计学院', '待补充', '贤德2栋233'),
(2147483647, 111111123, '李四', '会计学院', '待补充', '贤德2栋233'),
(2147483647, 111111124, '李五', '艺术与设计学院', '待补充', '贤德2栋233'),
(234546678, 111111125, '李六', '艺术与设计学院', '待补充', '贤德2栋233'),
(541657564, 111111126, '李七', '艺术与设计学院', '待补充', '贤德2栋233'),
(1234547, 111111127, '李八', '艺术与设计学院', '待补充', '贤德2栋233'),
(123453456, 111111128, '李九', '艺术与设计学院', '待补充', '贤德2栋233'),
(544231546, 111111129, '王一', '艺术与设计学院', '待补充', '贤德2栋233'),
(12334256, 111111130, '王二', '艺术与设计学院', '待补充', '咸嘉3栋203'),
(655464235, 111111131, '王三', '艺术与设计学院', '待补充', '咸嘉3栋203'),
(2147483647, 111111132, '王四', '计算机与信息工程学院', '待补充', '咸嘉3栋203'),
(21345467, 111111133, '王五', '计算机与信息工程学院', '待补充', '咸嘉3栋203'),
(2147483647, 111111134, '王六', '计算机与信息工程学院', '待补充', '咸嘉3栋309'),
(12343465, 111111135, '王七', '计算机与信息工程学院', '待补充', '咸嘉3栋309'),
(123434265, 111111136, '王八', '计算机与信息工程学院', '待补充', '咸嘉3栋309'),
(2147483647, 111111137, '王九', '计算机与信息工程学院', '待补充', '咸嘉3栋309'),
(124356, 111111140, '王九', '会计学院', '待补充', '咸嘉3栋399');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
